## Ejercicio - pandas 3

In [31]:
import numpy as np
import pandas as pd

In [32]:
# Versiones

print(f"numpy=={np.__version__}")
print(f"pandas=={pd.__version__}")

numpy==2.2.0
pandas==2.2.3

### Ejercicio 0:
- Carga ambos archivos **titanic_1.csv** y **titanic_2.csv** y guardalos en **df1** y **df2** respectivamente:

In [33]:
df1 = pd.read_csv("../Data/titanic_1.csv")
df2 = pd.read_csv("../Data/titanic_2.csv")

### Ejercicio 1:
- Mostrar las estadisticas de cada uno de los DataFrames.

In [34]:
df1.describe()
df2.describe()

       PassengerId    Survived      Pclass        Fare
count   891.000000  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642   32.204208
std     257.353842    0.486592    0.836071   49.693429
min       1.000000    0.000000    1.000000    0.000000
25%     223.500000    0.000000    2.000000    7.910400
50%     446.000000    0.000000    3.000000   14.454200
75%     668.500000    1.000000    3.000000   31.000000
max     891.000000    1.000000    3.000000  512.329200

### Ejercicio 2:
- Unir los DataFrames para obtener solo uno.

In [35]:
df1.head(1)

   PassengerId                     Name   Sex   Age
0            1  Braund, Mr. Owen Harris  male  22.0

In [36]:
df2.head(1)

   PassengerId  Survived  Pclass     Ticket  Fare
0            1         0       3  A/5 21171  7.25

In [37]:
df = pd.merge(df1, df2)

### Ejercicio 3:
- Imprimir las últimas 5 filas de las columnas de nombre y edad

In [41]:
df[["Name", "Age"]].tail(5)

                                         Name   Age
886                     Montvila, Rev. Juozas  27.0
887              Graham, Miss. Margaret Edith  19.0
888  Johnston, Miss. Catherine Helen "Carrie"   NaN
889                     Behr, Mr. Karl Howell  26.0
890                       Dooley, Mr. Patrick  32.0

### Ejercicio 4:
- Imprimir las primeras 10 filas de las instancias que en sexo sean igual a femenino.

In [39]:
df[df["Sex"] == "female"].head(10)

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,1,PC 17599,71.2833
2,3,"Heikkinen, Miss. Laina",female,26.0,1,3,STON/O2. 3101282,7.9250
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,1,113803,53.1000
8,9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,1,3,347742,11.1333
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,2,237736,30.0708
10,11,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,3,PP 9549,16.7000
11,12,"Bonnell, Miss. Elizabeth",female,58.0,1,1,113783,26.5500
14,15,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,3,350406,7.8542
15,16,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,1,2,248706,16.0000
18,19,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,0,3,345763,18.0000

### Ejercicio 5:
- Imprimir las instancias que en la columna **Fare** sean menor a 33 y en la columna **Pclass** igual a 2.

In [53]:
df_class2= df[(df["Fare"] < 33) & (df["Pclass"] == 2)]

In [54]:
df_class2

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,2,237736,30.0708
15,16,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,1,2,248706,16.0000
17,18,"Williams, Mr. Charles Eugene",male,NaN,1,2,244373,13.0000
20,21,"Fynney, Mr. Joseph J",male,35.0,0,2,239865,26.0000
21,22,"Beesley, Mr. Lawrence",male,34.0,1,2,248698,13.0000
...,...,...,...,...,...,...,...,...
866,867,"Duran y More, Miss. Asuncion",female,27.0,1,2,SC/PARIS 2149,13.8583
874,875,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,2,P/PP 3381,24.0000
880,881,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,1,2,230433,26.0000
883,884,"Banfield, Mr. Frederick James",male,28.0,0,2,C.A./SOTON 34068,10.5000
886,887,"Montvila, Rev. Juozas",male,27.0,0,2,211536,13.0000

### Ejercicio 6:
- Del resultado anterior obten el número de hombres y el número de mujeres.

In [56]:
df_class2["Sex"].value_counts()

Sex
male      95
female    68
Name: count, dtype: int64

### Ejercicio 7:
- Obten el costo total de los tickets de hombres y el costo total de los tickets de mujeres.

In [58]:
df[df["Sex"] == "female"]

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,1,PC 17599,71.2833
2,3,"Heikkinen, Miss. Laina",female,26.0,1,3,STON/O2. 3101282,7.9250
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,1,113803,53.1000
8,9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,1,3,347742,11.1333
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,2,237736,30.0708
...,...,...,...,...,...,...,...,...
880,881,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,1,2,230433,26.0000
882,883,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,3,7552,10.5167
885,886,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,3,382652,29.1250
887,888,"Graham, Miss. Margaret Edith",female,19.0,1,1,112053,30.0000
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,0,3,W./C. 6607,23.4500

In [ ]:
df[df["Sex"] == "male"]

### Ejercicio 8:
- Obten el costo total de los tickets por cada clase (1, 2 y 3) y el número de pasajeros de cada clase.

### Ejercicio 9:
- Crear una columna con el apellido de cada pasajero y agregala al DataFrame.

### Ejercicio 10:
- Encuentra si se repiten apellidos en la columna que se creo en el ejercicio anterior. (Usa _**.value_counts()**_)

### Ejercicio 11:
- Encuentra los apellidos que se repiten en la columna recien creada. Es decir, solo muestra los apellidos que aparecen más de 1 vez.

### Ejercicio 12:
- Imprime los primeros 10 pasajeros que tengan un **PassengerID** multiplo de 3.

### Ejercicio 13:
- ¿Cuales son los apellidos de los pasajeros que son mujeres y menores de 20 años?

### Ejercicio 14:
- ¿Cuales son los apellidos de los pasajeros que son hombres y mayor de 45 años?

### Ejercicio 15:
- Compara si coinciden los apellidos generados en los ejercicios anteriores.

### Ejercicio 16:
- Encuentra los 10 pasajeros que no sobrevivieron más jovenes e imprime cuantos son hombres y cuantos son mujeres.

### Ejercicio 17:
-  En un DataFrame muestra 3 pasajeros que sean hombres y 3 que sean mujeres, que hayan sobrevivido y para cada clase de la columna **Pclass**.

### Ejercicio 18:
- Obtener el tipo de elementos de cada columna y convierte los que sean "int64" a "int32". Evalua la memoria que consume antes y después de convertir las columnas y comenta la diferencia.

### Ejercicio 19:
- Encuentra a los pasajeros de la clase 1 y 3 entre 20 y 25 años y comprueba si son más hombres o mujeres.

### Ejercicio 20:
- Agrega una nueva columna al DataFrame que se llame: "Rango edad" y va a categorizar de la siguiente manera:
    - Niño < 11 años
    - Joven < 18 años
    - Adulto < 50 años
    - Mayor >= 50 años

In [60]:
def rango_edad(edad):
    if edad < 11:
        return "niño"
    elif edad < 18:
        return "joven"
    elif edad < 50:
        return "adulto"
    else:
        return "mayor"
    
df["Rango_edad"] = df["Age"].apply(rango_edad)
df.head(10)

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare,Rango_edad
0,1,"Braund, Mr. Owen Harris",male,22.0,0,3,A/5 21171,7.2500,adulto
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,1,PC 17599,71.2833,adulto
2,3,"Heikkinen, Miss. Laina",female,26.0,1,3,STON/O2. 3101282,7.9250,adulto
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,1,113803,53.1000,adulto
4,5,"Allen, Mr. William Henry",male,35.0,0,3,373450,8.0500,adulto
5,6,"Moran, Mr. James",male,NaN,0,3,330877,8.4583,mayor
6,7,"McCarthy, Mr. Timothy J",male,54.0,0,1,17463,51.8625,mayor
7,8,"Palsson, Master. Gosta Leonard",male,2.0,0,3,349909,21.0750,niño
8,9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,1,3,347742,11.1333,adulto
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,2,237736,30.0708,joven

### Ejercicio 21:
- Encontrar a los pasajeros "jovenes" y "mayores" de la clase 2 y 3 que hayan sobrevivido. Imprimir los 10 primeros.

### Ejercicio 22:
- Encuentra la edad promedio de todos los pasajeros y reemmplazala por los **NaN** en la columna de **Age** y ejecuta el ejercicio anterior.

### Ejercicio 23:
- Cambia a español la columna **Sex**.

### Ejercicio 24:
- Convierte a mayusculas todas las columnas que los valores sean cadenas.

In [63]:
df.dtypes.to_dict().items()

dict_items([('PassengerId', dtype('int64')), ('Name', dtype('O')), ('Sex', dtype('O')), ('Age', dtype('float64')), ('Survived', dtype('int64')), ('Pclass', dtype('int64')), ('Ticket', dtype('O')), ('Fare', dtype('float64')), ('Rango_edad', dtype('O'))])

In [69]:
for nombre_columna, tipo_dato in df.dtypes.to_dict().items():
    if tipo_dato == "object":        
        df[nombre_columna] = df[nombre_columna]. apply(lambda x : x.upper())

In [70]:
df.head(5)

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare,Rango_edad
0,1,"BRAUND, MR. OWEN HARRIS",MALE,22.0,0,3,A/5 21171,7.2500,ADULTO
1,2,"CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS TH...",FEMALE,38.0,1,1,PC 17599,71.2833,ADULTO
2,3,"HEIKKINEN, MISS. LAINA",FEMALE,26.0,1,3,STON/O2. 3101282,7.9250,ADULTO
3,4,"FUTRELLE, MRS. JACQUES HEATH (LILY MAY PEEL)",FEMALE,35.0,1,1,113803,53.1000,ADULTO
4,5,"ALLEN, MR. WILLIAM HENRY",MALE,35.0,0,3,373450,8.0500,ADULTO

### Ejercicio 25:
- Agrupa por sexo y rango de edad y encuentra la edad promedio.

### Ejercicio 26:
- Divide la columna name en las siguientes columnas:
    - Mrs/Miss
    - Apellido
    - Nombre(s)
    
**Nota: Ignora el resto de información.**

In [40]:
################################################################################################################################